grevaillot/svd_tools/headers/ATSAMV71N21B/usart0.h
#pragma once 

/* --- USART0: Universal Synchronous Asynchronous Receiver Transmitter  */

/** @defgroup usart0_registers Universal Synchronous Asynchronous Receiver Transmitter Register
@{*/

/** USART0_US_CR_USART_MODE Control Register **/
#define USART0_US_CR_USART_MODE			MMIO32(USART0_BASE + 0x00)
/** USART0_US_CR_SPI_MODE Control Register **/
#define USART0_US_CR_SPI_MODE			MMIO32(USART0_BASE + 0x00)
/** USART0_US_CR_LIN_MODE Control Register **/
#define USART0_US_CR_LIN_MODE			MMIO32(USART0_BASE + 0x00)
/** USART0_US_MR_USART_MODE Mode Register **/
#define USART0_US_MR_USART_MODE			MMIO32(USART0_BASE + 0x04)
/** USART0_US_MR_SPI_MODE Mode Register **/
#define USART0_US_MR_SPI_MODE			MMIO32(USART0_BASE + 0x04)
/** USART0_US_IER_USART_MODE Interrupt Enable Register **/
#define USART0_US_IER_USART_MODE			MMIO32(USART0_BASE + 0x08)
/** USART0_US_IER_USART_LIN_MODE Interrupt Enable Register **/
#define USART0_US_IER_USART_LIN_MODE			MMIO32(USART0_BASE + 0x08)
/** USART0_US_IER_SPI_MODE Interrupt Enable Register **/
#define USART0_US_IER_SPI_MODE			MMIO32(USART0_BASE + 0x08)
/** USART0_US_IER_LIN_MODE Interrupt Enable Register **/
#define USART0_US_IER_LIN_MODE			MMIO32(USART0_BASE + 0x08)
/** USART0_US_IER_LON_MODE Interrupt Enable Register **/
#define USART0_US_IER_LON_MODE			MMIO32(USART0_BASE + 0x08)
/** USART0_US_IER_LON_SPI_MODE Interrupt Enable Register **/
#define USART0_US_IER_LON_SPI_MODE			MMIO32(USART0_BASE + 0x08)
/** USART0_US_IDR_USART_MODE Interrupt Disable Register **/
#define USART0_US_IDR_USART_MODE			MMIO32(USART0_BASE + 0x0c)
/** USART0_US_IDR_USART_LIN_MODE Interrupt Disable Register **/
#define USART0_US_IDR_USART_LIN_MODE			MMIO32(USART0_BASE + 0x0c)
/** USART0_US_IDR_SPI_MODE Interrupt Disable Register **/
#define USART0_US_IDR_SPI_MODE			MMIO32(USART0_BASE + 0x0c)
/** USART0_US_IDR_LIN_MODE Interrupt Disable Register **/
#define USART0_US_IDR_LIN_MODE			MMIO32(USART0_BASE + 0x0c)
/** USART0_US_IDR_LON_MODE Interrupt Disable Register **/
#define USART0_US_IDR_LON_MODE			MMIO32(USART0_BASE + 0x0c)
/** USART0_US_IDR_LON_SPI_MODE Interrupt Disable Register **/
#define USART0_US_IDR_LON_SPI_MODE			MMIO32(USART0_BASE + 0x0c)
/** USART0_US_IMR_USART_MODE Interrupt Mask Register **/
#define USART0_US_IMR_USART_MODE			MMIO32(USART0_BASE + 0x10)
/** USART0_US_IMR_USART_LIN_MODE Interrupt Mask Register **/
#define USART0_US_IMR_USART_LIN_MODE			MMIO32(USART0_BASE + 0x10)
/** USART0_US_IMR_SPI_MODE Interrupt Mask Register **/
#define USART0_US_IMR_SPI_MODE			MMIO32(USART0_BASE + 0x10)
/** USART0_US_IMR_LIN_MODE Interrupt Mask Register **/
#define USART0_US_IMR_LIN_MODE			MMIO32(USART0_BASE + 0x10)
/** USART0_US_IMR_LON_MODE Interrupt Mask Register **/
#define USART0_US_IMR_LON_MODE			MMIO32(USART0_BASE + 0x10)
/** USART0_US_IMR_LON_SPI_MODE Interrupt Mask Register **/
#define USART0_US_IMR_LON_SPI_MODE			MMIO32(USART0_BASE + 0x10)
/** USART0_US_CSR_USART_MODE Channel Status Register **/
#define USART0_US_CSR_USART_MODE			MMIO32(USART0_BASE + 0x14)
/** USART0_US_CSR_USART_LIN_MODE Channel Status Register **/
#define USART0_US_CSR_USART_LIN_MODE			MMIO32(USART0_BASE + 0x14)
/** USART0_US_CSR_SPI_MODE Channel Status Register **/
#define USART0_US_CSR_SPI_MODE			MMIO32(USART0_BASE + 0x14)
/** USART0_US_CSR_LIN_MODE Channel Status Register **/
#define USART0_US_CSR_LIN_MODE			MMIO32(USART0_BASE + 0x14)
/** USART0_US_CSR_LON_MODE Channel Status Register **/
#define USART0_US_CSR_LON_MODE			MMIO32(USART0_BASE + 0x14)
/** USART0_US_CSR_LON_SPI_MODE Channel Status Register **/
#define USART0_US_CSR_LON_SPI_MODE			MMIO32(USART0_BASE + 0x14)
/** USART0_US_RHR Receive Holding Register **/
#define USART0_US_RHR			MMIO32(USART0_BASE + 0x18)
/** USART0_US_THR Transmit Holding Register **/
#define USART0_US_THR			MMIO32(USART0_BASE + 0x1c)
/** USART0_US_BRGR Baud Rate Generator Register **/
#define USART0_US_BRGR			MMIO32(USART0_BASE + 0x20)
/** USART0_US_RTOR Receiver Timeout Register **/
#define USART0_US_RTOR			MMIO32(USART0_BASE + 0x24)
/** USART0_US_TTGR_USART_MODE Transmitter Timeguard Register **/
#define USART0_US_TTGR_USART_MODE			MMIO32(USART0_BASE + 0x28)
/** USART0_US_TTGR_LON_MODE Transmitter Timeguard Register **/
#define USART0_US_TTGR_LON_MODE			MMIO32(USART0_BASE + 0x28)
/** USART0_US_FIDI_USART_MODE FI DI Ratio Register **/
#define USART0_US_FIDI_USART_MODE			MMIO32(USART0_BASE + 0x40)
/** USART0_US_FIDI_LON_MODE FI DI Ratio Register **/
#define USART0_US_FIDI_LON_MODE			MMIO32(USART0_BASE + 0x40)
/** USART0_US_NER Number of Errors Register **/
#define USART0_US_NER			MMIO32(USART0_BASE + 0x44)
/** USART0_US_IF IrDA Filter Register **/
#define USART0_US_IF			MMIO32(USART0_BASE + 0x4c)
/** USART0_US_MAN Manchester Configuration Register **/
#define USART0_US_MAN			MMIO32(USART0_BASE + 0x50)
/** USART0_US_LINMR LIN Mode Register **/
#define USART0_US_LINMR			MMIO32(USART0_BASE + 0x54)
/** USART0_US_LINIR LIN Identifier Register **/
#define USART0_US_LINIR			MMIO32(USART0_BASE + 0x58)
/** USART0_US_LINBRR LIN Baud Rate Register **/
#define USART0_US_LINBRR			MMIO32(USART0_BASE + 0x5c)
/** USART0_US_LONMR LON Mode Register **/
#define USART0_US_LONMR			MMIO32(USART0_BASE + 0x60)
/** USART0_US_LONPR LON Preamble Register **/
#define USART0_US_LONPR			MMIO32(USART0_BASE + 0x64)
/** USART0_US_LONDL LON Data Length Register **/
#define USART0_US_LONDL			MMIO32(USART0_BASE + 0x68)
/** USART0_US_LONL2HDR LON L2HDR Register **/
#define USART0_US_LONL2HDR			MMIO32(USART0_BASE + 0x6c)
/** USART0_US_LONBL LON Backlog Register **/
#define USART0_US_LONBL			MMIO32(USART0_BASE + 0x70)
/** USART0_US_LONB1TX LON Beta1 Tx Register **/
#define USART0_US_LONB1TX			MMIO32(USART0_BASE + 0x74)
/** USART0_US_LONB1RX LON Beta1 Rx Register **/
#define USART0_US_LONB1RX			MMIO32(USART0_BASE + 0x78)
/** USART0_US_LONPRIO LON Priority Register **/
#define USART0_US_LONPRIO			MMIO32(USART0_BASE + 0x7c)
/** USART0_US_IDTTX LON IDT Tx Register **/
#define USART0_US_IDTTX			MMIO32(USART0_BASE + 0x80)
/** USART0_US_IDTRX LON IDT Rx Register **/
#define USART0_US_IDTRX			MMIO32(USART0_BASE + 0x84)
/** USART0_US_ICDIFF IC DIFF Register **/
#define USART0_US_ICDIFF			MMIO32(USART0_BASE + 0x88)
/** USART0_US_WPMR Write Protection Mode Register **/
#define USART0_US_WPMR			MMIO32(USART0_BASE + 0xe4)
/** USART0_US_WPSR Write Protection Status Register **/
#define USART0_US_WPSR			MMIO32(USART0_BASE + 0xe8)

/**@}*/


/** @defgroup usart0_us_cr_usart_mode USCRUSARTMODE Control Register
@{*/

/** USART0_US_CR_USART_MODE_RTSDIS Request to Send Disable **/
#define USART0_US_CR_USART_MODE_RTSDIS		(1 << 19)
/** USART0_US_CR_USART_MODE_RTSEN Request to Send Enable **/
#define USART0_US_CR_USART_MODE_RTSEN		(1 << 18)
/** USART0_US_CR_USART_MODE_DTRDIS Data Terminal Ready Disable **/
#define USART0_US_CR_USART_MODE_DTRDIS		(1 << 17)
/** USART0_US_CR_USART_MODE_DTREN Data Terminal Ready Enable **/
#define USART0_US_CR_USART_MODE_DTREN		(1 << 16)
/** USART0_US_CR_USART_MODE_RETTO Start Timeout Immediately **/
#define USART0_US_CR_USART_MODE_RETTO		(1 << 15)
/** USART0_US_CR_USART_MODE_RSTNACK Reset Non Acknowledge **/
#define USART0_US_CR_USART_MODE_RSTNACK		(1 << 14)
/** USART0_US_CR_USART_MODE_RSTIT Reset Iterations **/
#define USART0_US_CR_USART_MODE_RSTIT		(1 << 13)
/** USART0_US_CR_USART_MODE_SENDA Send Address **/
#define USART0_US_CR_USART_MODE_SENDA		(1 << 12)
/** USART0_US_CR_USART_MODE_STTTO Clear TIMEOUT Flag and Start Timeout After Next Character Received **/
#define USART0_US_CR_USART_MODE_STTTO		(1 << 11)
/** USART0_US_CR_USART_MODE_STPBRK Stop Break **/
#define USART0_US_CR_USART_MODE_STPBRK		(1 << 10)
/** USART0_US_CR_USART_MODE_STTBRK Start Break **/
#define USART0_US_CR_USART_MODE_STTBRK		(1 << 9)
/** USART0_US_CR_USART_MODE_RSTSTA Reset Status Bits **/
#define USART0_US_CR_USART_MODE_RSTSTA		(1 << 8)
/** USART0_US_CR_USART_MODE_TXDIS Transmitter Disable **/
#define USART0_US_CR_USART_MODE_TXDIS		(1 << 7)
/** USART0_US_CR_USART_MODE_TXEN Transmitter Enable **/
#define USART0_US_CR_USART_MODE_TXEN		(1 << 6)
/** USART0_US_CR_USART_MODE_RXDIS Receiver Disable **/
#define USART0_US_CR_USART_MODE_RXDIS		(1 << 5)
/** USART0_US_CR_USART_MODE_RXEN Receiver Enable **/
#define USART0_US_CR_USART_MODE_RXEN		(1 << 4)
/** USART0_US_CR_USART_MODE_RSTTX Reset Transmitter **/
#define USART0_US_CR_USART_MODE_RSTTX		(1 << 3)
/** USART0_US_CR_USART_MODE_RSTRX Reset Receiver **/
#define USART0_US_CR_USART_MODE_RSTRX		(1 << 2)

/**@}*/

