grevaillot/svd_tools/headers/ATSAMV71N21B/usart0.h
/** @defgroup usart0_us_cr_spi_mode USCRSPIMODE Control Register
@{*/

/** USART0_US_CR_SPI_MODE_RCS Release SPI Chip Select **/
#define USART0_US_CR_SPI_MODE_RCS		(1 << 19)
/** USART0_US_CR_SPI_MODE_FCS Force SPI Chip Select **/
#define USART0_US_CR_SPI_MODE_FCS		(1 << 18)
/** USART0_US_CR_SPI_MODE_RSTSTA Reset Status Bits **/
#define USART0_US_CR_SPI_MODE_RSTSTA		(1 << 8)
/** USART0_US_CR_SPI_MODE_TXDIS Transmitter Disable **/
#define USART0_US_CR_SPI_MODE_TXDIS		(1 << 7)
/** USART0_US_CR_SPI_MODE_TXEN Transmitter Enable **/
#define USART0_US_CR_SPI_MODE_TXEN		(1 << 6)
/** USART0_US_CR_SPI_MODE_RXDIS Receiver Disable **/
#define USART0_US_CR_SPI_MODE_RXDIS		(1 << 5)
/** USART0_US_CR_SPI_MODE_RXEN Receiver Enable **/
#define USART0_US_CR_SPI_MODE_RXEN		(1 << 4)
/** USART0_US_CR_SPI_MODE_RSTTX Reset Transmitter **/
#define USART0_US_CR_SPI_MODE_RSTTX		(1 << 3)
/** USART0_US_CR_SPI_MODE_RSTRX Reset Receiver **/
#define USART0_US_CR_SPI_MODE_RSTRX		(1 << 2)

/**@}*/

/** @defgroup usart0_us_cr_lin_mode USCRLINMODE Control Register
@{*/

/** USART0_US_CR_LIN_MODE_LINWKUP Send LIN Wakeup Signal **/
#define USART0_US_CR_LIN_MODE_LINWKUP		(1 << 21)
/** USART0_US_CR_LIN_MODE_LINABT Abort LIN Transmission **/
#define USART0_US_CR_LIN_MODE_LINABT		(1 << 20)
/** USART0_US_CR_LIN_MODE_RSTSTA Reset Status Bits **/
#define USART0_US_CR_LIN_MODE_RSTSTA		(1 << 8)
/** USART0_US_CR_LIN_MODE_TXDIS Transmitter Disable **/
#define USART0_US_CR_LIN_MODE_TXDIS		(1 << 7)
/** USART0_US_CR_LIN_MODE_TXEN Transmitter Enable **/
#define USART0_US_CR_LIN_MODE_TXEN		(1 << 6)
/** USART0_US_CR_LIN_MODE_RXDIS Receiver Disable **/
#define USART0_US_CR_LIN_MODE_RXDIS		(1 << 5)
/** USART0_US_CR_LIN_MODE_RXEN Receiver Enable **/
#define USART0_US_CR_LIN_MODE_RXEN		(1 << 4)
/** USART0_US_CR_LIN_MODE_RSTTX Reset Transmitter **/
#define USART0_US_CR_LIN_MODE_RSTTX		(1 << 3)
/** USART0_US_CR_LIN_MODE_RSTRX Reset Receiver **/
#define USART0_US_CR_LIN_MODE_RSTRX		(1 << 2)

/**@}*/

/** @defgroup usart0_us_mr_usart_mode USMRUSARTMODE Mode Register
@{*/

/** USART0_US_MR_USART_MODE_ONEBIT Start Frame Delimiter Selector **/
#define USART0_US_MR_USART_MODE_ONEBIT		(1 << 31)
/** USART0_US_MR_USART_MODE_MODSYNC Manchester Synchronization Mode **/
#define USART0_US_MR_USART_MODE_MODSYNC		(1 << 30)
/** USART0_US_MR_USART_MODE_MAN Manchester Encoder/Decoder Enable **/
#define USART0_US_MR_USART_MODE_MAN		(1 << 29)
/** USART0_US_MR_USART_MODE_FILTER Receive Line Filter **/
#define USART0_US_MR_USART_MODE_FILTER		(1 << 28)

#define USART0_US_MR_USART_MODE_MAX_ITERATION_SHIFT		24
#define USART0_US_MR_USART_MODE_MAX_ITERATION_MASK		0x07
/** @defgroup usart0_us_mr_usart_mode_max_iteration MAXITERATION Maximum Number of Automatic Iteration
@{*/
/**@}*/

/** USART0_US_MR_USART_MODE_INVDATA Inverted Data **/
#define USART0_US_MR_USART_MODE_INVDATA		(1 << 23)
/** USART0_US_MR_USART_MODE_VAR_SYNC Variable Synchronization of Command/Data Sync Start Frame Delimiter **/
#define USART0_US_MR_USART_MODE_VAR_SYNC		(1 << 22)
/** USART0_US_MR_USART_MODE_DSNACK Disable Successive NACK **/
#define USART0_US_MR_USART_MODE_DSNACK		(1 << 21)
/** USART0_US_MR_USART_MODE_INACK Inhibit Non Acknowledge **/
#define USART0_US_MR_USART_MODE_INACK		(1 << 20)
/** USART0_US_MR_USART_MODE_OVER Oversampling Mode **/
#define USART0_US_MR_USART_MODE_OVER		(1 << 19)
/** USART0_US_MR_USART_MODE_CLKO Clock Output Select **/
#define USART0_US_MR_USART_MODE_CLKO		(1 << 18)
/** USART0_US_MR_USART_MODE_MODE9 9-bit Character Length **/
#define USART0_US_MR_USART_MODE_MODE9		(1 << 17)
/** USART0_US_MR_USART_MODE_MSBF Bit Order **/
#define USART0_US_MR_USART_MODE_MSBF		(1 << 16)

#define USART0_US_MR_USART_MODE_CHMODE_SHIFT		14
#define USART0_US_MR_USART_MODE_CHMODE_MASK		0x03
/** @defgroup usart0_us_mr_usart_mode_chmode CHMODE Channel Mode
@{*/
/**@}*/


#define USART0_US_MR_USART_MODE_NBSTOP_SHIFT		12
#define USART0_US_MR_USART_MODE_NBSTOP_MASK		0x03
/** @defgroup usart0_us_mr_usart_mode_nbstop NBSTOP Number of Stop Bits
@{*/
/**@}*/


#define USART0_US_MR_USART_MODE_PAR_SHIFT		9
#define USART0_US_MR_USART_MODE_PAR_MASK		0x07
/** @defgroup usart0_us_mr_usart_mode_par PAR Parity Type
@{*/
/**@}*/

/** USART0_US_MR_USART_MODE_SYNC Synchronous Mode Select **/
#define USART0_US_MR_USART_MODE_SYNC		(1 << 8)

#define USART0_US_MR_USART_MODE_CHRL_SHIFT		6
#define USART0_US_MR_USART_MODE_CHRL_MASK		0x03
/** @defgroup usart0_us_mr_usart_mode_chrl CHRL Character Length
@{*/
/**@}*/


#define USART0_US_MR_USART_MODE_USCLKS_SHIFT		4
#define USART0_US_MR_USART_MODE_USCLKS_MASK		0x03
/** @defgroup usart0_us_mr_usart_mode_usclks USCLKS Clock Selection
@{*/
/**@}*/


#define USART0_US_MR_USART_MODE_USART_MODE_SHIFT		0
#define USART0_US_MR_USART_MODE_USART_MODE_MASK		0x0f
/** @defgroup usart0_us_mr_usart_mode_usart_mode USARTMODE USART Mode of Operation
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_mr_spi_mode USMRSPIMODE Mode Register
@{*/

/** USART0_US_MR_SPI_MODE_WRDBT Wait Read Data Before Transfer **/
#define USART0_US_MR_SPI_MODE_WRDBT		(1 << 20)
/** USART0_US_MR_SPI_MODE_CLKO Clock Output Select **/
#define USART0_US_MR_SPI_MODE_CLKO		(1 << 18)
/** USART0_US_MR_SPI_MODE_CPOL SPI Clock Polarity **/
#define USART0_US_MR_SPI_MODE_CPOL		(1 << 16)
/** USART0_US_MR_SPI_MODE_CPHA SPI Clock Phase **/
#define USART0_US_MR_SPI_MODE_CPHA		(1 << 8)

#define USART0_US_MR_SPI_MODE_CHRL_SHIFT		6
#define USART0_US_MR_SPI_MODE_CHRL_MASK		0x03
/** @defgroup usart0_us_mr_spi_mode_chrl CHRL Character Length
@{*/
/**@}*/


#define USART0_US_MR_SPI_MODE_USCLKS_SHIFT		4
#define USART0_US_MR_SPI_MODE_USCLKS_MASK		0x03
/** @defgroup usart0_us_mr_spi_mode_usclks USCLKS Clock Selection
@{*/
/**@}*/


#define USART0_US_MR_SPI_MODE_USART_MODE_SHIFT		0
#define USART0_US_MR_SPI_MODE_USART_MODE_MASK		0x0f
/** @defgroup usart0_us_mr_spi_mode_usart_mode USARTMODE USART Mode of Operation
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_ier_usart_mode USIERUSARTMODE Interrupt Enable Register
@{*/

/** USART0_US_IER_USART_MODE_MANE Manchester Error Interrupt Enable **/
#define USART0_US_IER_USART_MODE_MANE		(1 << 24)
/** USART0_US_IER_USART_MODE_CTSIC Clear to Send Input Change Interrupt Enable **/
#define USART0_US_IER_USART_MODE_CTSIC		(1 << 19)
/** USART0_US_IER_USART_MODE_DCDIC Data Carrier Detect Input Change Interrupt Enable **/
#define USART0_US_IER_USART_MODE_DCDIC		(1 << 18)
/** USART0_US_IER_USART_MODE_DSRIC Data Set Ready Input Change Enable **/
#define USART0_US_IER_USART_MODE_DSRIC		(1 << 17)
/** USART0_US_IER_USART_MODE_RIIC Ring Indicator Input Change Enable **/
#define USART0_US_IER_USART_MODE_RIIC		(1 << 16)
/** USART0_US_IER_USART_MODE_NACK Non Acknowledge Interrupt Enable **/
#define USART0_US_IER_USART_MODE_NACK		(1 << 13)
/** USART0_US_IER_USART_MODE_ITER Max number of Repetitions Reached Interrupt Enable **/
#define USART0_US_IER_USART_MODE_ITER		(1 << 10)
/** USART0_US_IER_USART_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART0_US_IER_USART_MODE_TXEMPTY		(1 << 9)
/** USART0_US_IER_USART_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART0_US_IER_USART_MODE_OVRE		(1 << 5)
/** USART0_US_IER_USART_MODE_RXBRK Receiver Break Interrupt Enable **/
#define USART0_US_IER_USART_MODE_RXBRK		(1 << 2)
/** USART0_US_IER_USART_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART0_US_IER_USART_MODE_TXRDY		(1 << 1)
/** USART0_US_IER_USART_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART0_US_IER_USART_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_us_ier_usart_lin_mode USIERUSARTLINMODE Interrupt Enable Register
@{*/

/** USART0_US_IER_USART_LIN_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART0_US_IER_USART_LIN_MODE_TXEMPTY		(1 << 9)
/** USART0_US_IER_USART_LIN_MODE_TIMEOUT Timeout Interrupt Enable **/
#define USART0_US_IER_USART_LIN_MODE_TIMEOUT		(1 << 8)
/** USART0_US_IER_USART_LIN_MODE_PARE Parity Error Interrupt Enable **/
#define USART0_US_IER_USART_LIN_MODE_PARE		(1 << 7)
/** USART0_US_IER_USART_LIN_MODE_FRAME Framing Error Interrupt Enable **/
#define USART0_US_IER_USART_LIN_MODE_FRAME		(1 << 6)
/** USART0_US_IER_USART_LIN_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART0_US_IER_USART_LIN_MODE_OVRE		(1 << 5)
/** USART0_US_IER_USART_LIN_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART0_US_IER_USART_LIN_MODE_TXRDY		(1 << 1)
/** USART0_US_IER_USART_LIN_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART0_US_IER_USART_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_us_ier_spi_mode USIERSPIMODE Interrupt Enable Register
@{*/

/** USART0_US_IER_SPI_MODE_NSSE NSS Line (Driving CTS Pin) Rising or Falling Edge Event **/
#define USART0_US_IER_SPI_MODE_NSSE		(1 << 19)
/** USART0_US_IER_SPI_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART0_US_IER_SPI_MODE_TXEMPTY		(1 << 9)
/** USART0_US_IER_SPI_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART0_US_IER_SPI_MODE_OVRE		(1 << 5)
/** USART0_US_IER_SPI_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART0_US_IER_SPI_MODE_TXRDY		(1 << 1)
/** USART0_US_IER_SPI_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART0_US_IER_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_us_ier_lin_mode USIERLINMODE Interrupt Enable Register
@{*/

/** USART0_US_IER_LIN_MODE_LINHTE LIN Header Timeout Error Interrupt Enable **/
#define USART0_US_IER_LIN_MODE_LINHTE		(1 << 31)
/** USART0_US_IER_LIN_MODE_LINSTE LIN Synch Tolerance Error Interrupt Enable **/
#define USART0_US_IER_LIN_MODE_LINSTE		(1 << 30)
/** USART0_US_IER_LIN_MODE_LINSNRE LIN Slave Not Responding Error Interrupt Enable **/
#define USART0_US_IER_LIN_MODE_LINSNRE		(1 << 29)
/** USART0_US_IER_LIN_MODE_LINCE LIN Checksum Error Interrupt Enable **/
#define USART0_US_IER_LIN_MODE_LINCE		(1 << 28)
/** USART0_US_IER_LIN_MODE_LINIPE LIN Identifier Parity Interrupt Enable **/
#define USART0_US_IER_LIN_MODE_LINIPE		(1 << 27)
/** USART0_US_IER_LIN_MODE_LINISFE LIN Inconsistent Synch Field Error Interrupt Enable **/
#define USART0_US_IER_LIN_MODE_LINISFE		(1 << 26)
/** USART0_US_IER_LIN_MODE_LINBE LIN Bus Error Interrupt Enable **/
#define USART0_US_IER_LIN_MODE_LINBE		(1 << 25)
/** USART0_US_IER_LIN_MODE_LINTC LIN Transfer Completed Interrupt Enable **/
#define USART0_US_IER_LIN_MODE_LINTC		(1 << 15)
/** USART0_US_IER_LIN_MODE_LINID LIN Identifier Sent or LIN Identifier Received Interrupt Enable **/
#define USART0_US_IER_LIN_MODE_LINID		(1 << 14)
/** USART0_US_IER_LIN_MODE_LINBK LIN Break Sent or LIN Break Received Interrupt Enable **/
#define USART0_US_IER_LIN_MODE_LINBK		(1 << 13)
/** USART0_US_IER_LIN_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART0_US_IER_LIN_MODE_TXEMPTY		(1 << 9)
/** USART0_US_IER_LIN_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART0_US_IER_LIN_MODE_OVRE		(1 << 5)
/** USART0_US_IER_LIN_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART0_US_IER_LIN_MODE_TXRDY		(1 << 1)
/** USART0_US_IER_LIN_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART0_US_IER_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_us_ier_lon_mode USIERLONMODE Interrupt Enable Register
@{*/

/** USART0_US_IER_LON_MODE_LBLOVFE LON Backlog Overflow Error Interrupt Enable **/
#define USART0_US_IER_LON_MODE_LBLOVFE		(1 << 28)
/** USART0_US_IER_LON_MODE_LRXD LON Reception Done Interrupt Enable **/
#define USART0_US_IER_LON_MODE_LRXD		(1 << 27)
/** USART0_US_IER_LON_MODE_LFET LON Frame Early Termination Interrupt Enable **/
#define USART0_US_IER_LON_MODE_LFET		(1 << 26)
/** USART0_US_IER_LON_MODE_LCOL LON Collision Interrupt Enable **/
#define USART0_US_IER_LON_MODE_LCOL		(1 << 25)
/** USART0_US_IER_LON_MODE_LTXD LON Transmission Done Interrupt Enable **/
#define USART0_US_IER_LON_MODE_LTXD		(1 << 24)
/** USART0_US_IER_LON_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART0_US_IER_LON_MODE_TXEMPTY		(1 << 9)
/** USART0_US_IER_LON_MODE_LCRCE LON CRC Error Interrupt Enable **/
#define USART0_US_IER_LON_MODE_LCRCE		(1 << 7)
/** USART0_US_IER_LON_MODE_LSFE LON Short Frame Error Interrupt Enable **/
#define USART0_US_IER_LON_MODE_LSFE		(1 << 6)
/** USART0_US_IER_LON_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART0_US_IER_LON_MODE_OVRE		(1 << 5)
/** USART0_US_IER_LON_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART0_US_IER_LON_MODE_TXRDY		(1 << 1)
/** USART0_US_IER_LON_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART0_US_IER_LON_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_us_ier_lon_spi_mode USIERLONSPIMODE Interrupt Enable Register
@{*/

/** USART0_US_IER_LON_SPI_MODE_UNRE Underrun Error Interrupt Enable **/
#define USART0_US_IER_LON_SPI_MODE_UNRE		(1 << 10)
/** USART0_US_IER_LON_SPI_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART0_US_IER_LON_SPI_MODE_TXEMPTY		(1 << 9)
/** USART0_US_IER_LON_SPI_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART0_US_IER_LON_SPI_MODE_OVRE		(1 << 5)
/** USART0_US_IER_LON_SPI_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART0_US_IER_LON_SPI_MODE_TXRDY		(1 << 1)
/** USART0_US_IER_LON_SPI_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART0_US_IER_LON_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_us_idr_usart_mode USIDRUSARTMODE Interrupt Disable Register
@{*/

