grevaillot/svd_tools/headers/ATSAMV71N21B/usart0.h
/** @defgroup usart0_us_imr_usart_mode USIMRUSARTMODE Interrupt Mask Register
@{*/

/** USART0_US_IMR_USART_MODE_MANE Manchester Error Interrupt Mask **/
#define USART0_US_IMR_USART_MODE_MANE		(1 << 24)
/** USART0_US_IMR_USART_MODE_CTSIC Clear to Send Input Change Interrupt Mask **/
#define USART0_US_IMR_USART_MODE_CTSIC		(1 << 19)
/** USART0_US_IMR_USART_MODE_DCDIC Data Carrier Detect Input Change Interrupt Mask **/
#define USART0_US_IMR_USART_MODE_DCDIC		(1 << 18)
/** USART0_US_IMR_USART_MODE_DSRIC Data Set Ready Input Change Mask **/
#define USART0_US_IMR_USART_MODE_DSRIC		(1 << 17)
/** USART0_US_IMR_USART_MODE_RIIC Ring Indicator Input Change Mask **/
#define USART0_US_IMR_USART_MODE_RIIC		(1 << 16)
/** USART0_US_IMR_USART_MODE_NACK Non Acknowledge Interrupt Mask **/
#define USART0_US_IMR_USART_MODE_NACK		(1 << 13)
/** USART0_US_IMR_USART_MODE_ITER Max Number of Repetitions Reached Interrupt Mask **/
#define USART0_US_IMR_USART_MODE_ITER		(1 << 10)
/** USART0_US_IMR_USART_MODE_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART0_US_IMR_USART_MODE_TXEMPTY		(1 << 9)
/** USART0_US_IMR_USART_MODE_OVRE Overrun Error Interrupt Mask **/
#define USART0_US_IMR_USART_MODE_OVRE		(1 << 5)
/** USART0_US_IMR_USART_MODE_RXBRK Receiver Break Interrupt Mask **/
#define USART0_US_IMR_USART_MODE_RXBRK		(1 << 2)
/** USART0_US_IMR_USART_MODE_TXRDY TXRDY Interrupt Mask **/
#define USART0_US_IMR_USART_MODE_TXRDY		(1 << 1)
/** USART0_US_IMR_USART_MODE_RXRDY RXRDY Interrupt Mask **/
#define USART0_US_IMR_USART_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_us_imr_usart_lin_mode USIMRUSARTLINMODE Interrupt Mask Register
@{*/

/** USART0_US_IMR_USART_LIN_MODE_DCDIC Data Carrier Detect Input Change Interrupt Mask **/
#define USART0_US_IMR_USART_LIN_MODE_DCDIC		(1 << 18)
/** USART0_US_IMR_USART_LIN_MODE_DSRIC Data Set Ready Input Change Mask **/
#define USART0_US_IMR_USART_LIN_MODE_DSRIC		(1 << 17)
/** USART0_US_IMR_USART_LIN_MODE_RIIC Ring Indicator Input Change Mask **/
#define USART0_US_IMR_USART_LIN_MODE_RIIC		(1 << 16)
/** USART0_US_IMR_USART_LIN_MODE_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART0_US_IMR_USART_LIN_MODE_TXEMPTY		(1 << 9)
/** USART0_US_IMR_USART_LIN_MODE_TIMEOUT Timeout Interrupt Mask **/
#define USART0_US_IMR_USART_LIN_MODE_TIMEOUT		(1 << 8)
/** USART0_US_IMR_USART_LIN_MODE_PARE Parity Error Interrupt Mask **/
#define USART0_US_IMR_USART_LIN_MODE_PARE		(1 << 7)
/** USART0_US_IMR_USART_LIN_MODE_FRAME Framing Error Interrupt Mask **/
#define USART0_US_IMR_USART_LIN_MODE_FRAME		(1 << 6)
/** USART0_US_IMR_USART_LIN_MODE_OVRE Overrun Error Interrupt Mask **/
#define USART0_US_IMR_USART_LIN_MODE_OVRE		(1 << 5)
/** USART0_US_IMR_USART_LIN_MODE_TXRDY TXRDY Interrupt Mask **/
#define USART0_US_IMR_USART_LIN_MODE_TXRDY		(1 << 1)
/** USART0_US_IMR_USART_LIN_MODE_RXRDY RXRDY Interrupt Mask **/
#define USART0_US_IMR_USART_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_us_imr_spi_mode USIMRSPIMODE Interrupt Mask Register
@{*/

/** USART0_US_IMR_SPI_MODE_NSSE NSS Line (Driving CTS Pin) Rising or Falling Edge Event **/
#define USART0_US_IMR_SPI_MODE_NSSE		(1 << 19)
/** USART0_US_IMR_SPI_MODE_DCDIC Data Carrier Detect Input Change Interrupt Mask **/
#define USART0_US_IMR_SPI_MODE_DCDIC		(1 << 18)
/** USART0_US_IMR_SPI_MODE_DSRIC Data Set Ready Input Change Mask **/
#define USART0_US_IMR_SPI_MODE_DSRIC		(1 << 17)
/** USART0_US_IMR_SPI_MODE_RIIC Ring Indicator Input Change Mask **/
#define USART0_US_IMR_SPI_MODE_RIIC		(1 << 16)
/** USART0_US_IMR_SPI_MODE_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART0_US_IMR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART0_US_IMR_SPI_MODE_OVRE Overrun Error Interrupt Mask **/
#define USART0_US_IMR_SPI_MODE_OVRE		(1 << 5)
/** USART0_US_IMR_SPI_MODE_TXRDY TXRDY Interrupt Mask **/
#define USART0_US_IMR_SPI_MODE_TXRDY		(1 << 1)
/** USART0_US_IMR_SPI_MODE_RXRDY RXRDY Interrupt Mask **/
#define USART0_US_IMR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_us_imr_lin_mode USIMRLINMODE Interrupt Mask Register
@{*/

/** USART0_US_IMR_LIN_MODE_LINHTE LIN Header Timeout Error Interrupt Mask **/
#define USART0_US_IMR_LIN_MODE_LINHTE		(1 << 31)
/** USART0_US_IMR_LIN_MODE_LINSTE LIN Synch Tolerance Error Interrupt Mask **/
#define USART0_US_IMR_LIN_MODE_LINSTE		(1 << 30)
/** USART0_US_IMR_LIN_MODE_LINSNRE LIN Slave Not Responding Error Interrupt Mask **/
#define USART0_US_IMR_LIN_MODE_LINSNRE		(1 << 29)
/** USART0_US_IMR_LIN_MODE_LINCE LIN Checksum Error Interrupt Mask **/
#define USART0_US_IMR_LIN_MODE_LINCE		(1 << 28)
/** USART0_US_IMR_LIN_MODE_LINIPE LIN Identifier Parity Interrupt Mask **/
#define USART0_US_IMR_LIN_MODE_LINIPE		(1 << 27)
/** USART0_US_IMR_LIN_MODE_LINISFE LIN Inconsistent Synch Field Error Interrupt Mask **/
#define USART0_US_IMR_LIN_MODE_LINISFE		(1 << 26)
/** USART0_US_IMR_LIN_MODE_LINBE LIN Bus Error Interrupt Mask **/
#define USART0_US_IMR_LIN_MODE_LINBE		(1 << 25)
/** USART0_US_IMR_LIN_MODE_DCDIC Data Carrier Detect Input Change Interrupt Mask **/
#define USART0_US_IMR_LIN_MODE_DCDIC		(1 << 18)
/** USART0_US_IMR_LIN_MODE_DSRIC Data Set Ready Input Change Mask **/
#define USART0_US_IMR_LIN_MODE_DSRIC		(1 << 17)
/** USART0_US_IMR_LIN_MODE_RIIC Ring Indicator Input Change Mask **/
#define USART0_US_IMR_LIN_MODE_RIIC		(1 << 16)
/** USART0_US_IMR_LIN_MODE_LINTC LIN Transfer Completed Interrupt Mask **/
#define USART0_US_IMR_LIN_MODE_LINTC		(1 << 15)
/** USART0_US_IMR_LIN_MODE_LINID LIN Identifier Sent or LIN Identifier Received Interrupt Mask **/
#define USART0_US_IMR_LIN_MODE_LINID		(1 << 14)
/** USART0_US_IMR_LIN_MODE_LINBK LIN Break Sent or LIN Break Received Interrupt Mask **/
#define USART0_US_IMR_LIN_MODE_LINBK		(1 << 13)
/** USART0_US_IMR_LIN_MODE_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART0_US_IMR_LIN_MODE_TXEMPTY		(1 << 9)
/** USART0_US_IMR_LIN_MODE_OVRE Overrun Error Interrupt Mask **/
#define USART0_US_IMR_LIN_MODE_OVRE		(1 << 5)
/** USART0_US_IMR_LIN_MODE_TXRDY TXRDY Interrupt Mask **/
#define USART0_US_IMR_LIN_MODE_TXRDY		(1 << 1)
/** USART0_US_IMR_LIN_MODE_RXRDY RXRDY Interrupt Mask **/
#define USART0_US_IMR_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_us_imr_lon_mode USIMRLONMODE Interrupt Mask Register
@{*/

