grevaillot/svd_tools/headers/ATSAMV71N21B/usart0.h
/** USART0_US_IMR_LON_MODE_LBLOVFE LON Backlog Overflow Error Interrupt Mask **/
#define USART0_US_IMR_LON_MODE_LBLOVFE		(1 << 28)
/** USART0_US_IMR_LON_MODE_LRXD LON Reception Done Interrupt Mask **/
#define USART0_US_IMR_LON_MODE_LRXD		(1 << 27)
/** USART0_US_IMR_LON_MODE_LFET LON Frame Early Termination Interrupt Mask **/
#define USART0_US_IMR_LON_MODE_LFET		(1 << 26)
/** USART0_US_IMR_LON_MODE_LCOL LON Collision Interrupt Mask **/
#define USART0_US_IMR_LON_MODE_LCOL		(1 << 25)
/** USART0_US_IMR_LON_MODE_LTXD LON Transmission Done Interrupt Mask **/
#define USART0_US_IMR_LON_MODE_LTXD		(1 << 24)
/** USART0_US_IMR_LON_MODE_DCDIC Data Carrier Detect Input Change Interrupt Mask **/
#define USART0_US_IMR_LON_MODE_DCDIC		(1 << 18)
/** USART0_US_IMR_LON_MODE_DSRIC Data Set Ready Input Change Mask **/
#define USART0_US_IMR_LON_MODE_DSRIC		(1 << 17)
/** USART0_US_IMR_LON_MODE_RIIC Ring Indicator Input Change Mask **/
#define USART0_US_IMR_LON_MODE_RIIC		(1 << 16)
/** USART0_US_IMR_LON_MODE_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART0_US_IMR_LON_MODE_TXEMPTY		(1 << 9)
/** USART0_US_IMR_LON_MODE_LCRCE LON CRC Error Interrupt Mask **/
#define USART0_US_IMR_LON_MODE_LCRCE		(1 << 7)
/** USART0_US_IMR_LON_MODE_LSFE LON Short Frame Error Interrupt Mask **/
#define USART0_US_IMR_LON_MODE_LSFE		(1 << 6)
/** USART0_US_IMR_LON_MODE_OVRE Overrun Error Interrupt Mask **/
#define USART0_US_IMR_LON_MODE_OVRE		(1 << 5)
/** USART0_US_IMR_LON_MODE_TXRDY TXRDY Interrupt Mask **/
#define USART0_US_IMR_LON_MODE_TXRDY		(1 << 1)
/** USART0_US_IMR_LON_MODE_RXRDY RXRDY Interrupt Mask **/
#define USART0_US_IMR_LON_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_us_imr_lon_spi_mode USIMRLONSPIMODE Interrupt Mask Register
@{*/

/** USART0_US_IMR_LON_SPI_MODE_DCDIC Data Carrier Detect Input Change Interrupt Mask **/
#define USART0_US_IMR_LON_SPI_MODE_DCDIC		(1 << 18)
/** USART0_US_IMR_LON_SPI_MODE_DSRIC Data Set Ready Input Change Mask **/
#define USART0_US_IMR_LON_SPI_MODE_DSRIC		(1 << 17)
/** USART0_US_IMR_LON_SPI_MODE_RIIC Ring Indicator Input Change Mask **/
#define USART0_US_IMR_LON_SPI_MODE_RIIC		(1 << 16)
/** USART0_US_IMR_LON_SPI_MODE_UNRE SPI Underrun Error Interrupt Mask **/
#define USART0_US_IMR_LON_SPI_MODE_UNRE		(1 << 10)
/** USART0_US_IMR_LON_SPI_MODE_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART0_US_IMR_LON_SPI_MODE_TXEMPTY		(1 << 9)
/** USART0_US_IMR_LON_SPI_MODE_OVRE Overrun Error Interrupt Mask **/
#define USART0_US_IMR_LON_SPI_MODE_OVRE		(1 << 5)
/** USART0_US_IMR_LON_SPI_MODE_TXRDY TXRDY Interrupt Mask **/
#define USART0_US_IMR_LON_SPI_MODE_TXRDY		(1 << 1)
/** USART0_US_IMR_LON_SPI_MODE_RXRDY RXRDY Interrupt Mask **/
#define USART0_US_IMR_LON_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_us_csr_usart_mode USCSRUSARTMODE Channel Status Register
@{*/

/** USART0_US_CSR_USART_MODE_MANERR Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA) **/
#define USART0_US_CSR_USART_MODE_MANERR		(1 << 24)
/** USART0_US_CSR_USART_MODE_CTS Image of CTS Input **/
#define USART0_US_CSR_USART_MODE_CTS		(1 << 23)
/** USART0_US_CSR_USART_MODE_DCD Image of DCD Input **/
#define USART0_US_CSR_USART_MODE_DCD		(1 << 22)
/** USART0_US_CSR_USART_MODE_DSR Image of DSR Input **/
#define USART0_US_CSR_USART_MODE_DSR		(1 << 21)
/** USART0_US_CSR_USART_MODE_RI Image of RI Input **/
#define USART0_US_CSR_USART_MODE_RI		(1 << 20)
/** USART0_US_CSR_USART_MODE_CTSIC Clear to Send Input Change Flag (cleared on read) **/
#define USART0_US_CSR_USART_MODE_CTSIC		(1 << 19)
/** USART0_US_CSR_USART_MODE_DCDIC Data Carrier Detect Input Change Flag (cleared on read) **/
#define USART0_US_CSR_USART_MODE_DCDIC		(1 << 18)
/** USART0_US_CSR_USART_MODE_DSRIC Data Set Ready Input Change Flag (cleared on read) **/
#define USART0_US_CSR_USART_MODE_DSRIC		(1 << 17)
/** USART0_US_CSR_USART_MODE_RIIC Ring Indicator Input Change Flag (cleared on read) **/
#define USART0_US_CSR_USART_MODE_RIIC		(1 << 16)
/** USART0_US_CSR_USART_MODE_NACK Non Acknowledge Interrupt (cleared by writing a one to bit US_CR.RSTNACK) **/
#define USART0_US_CSR_USART_MODE_NACK		(1 << 13)
/** USART0_US_CSR_USART_MODE_ITER Max Number of Repetitions Reached (cleared by writing a one to bit US_CR.RSTIT) **/
#define USART0_US_CSR_USART_MODE_ITER		(1 << 10)
/** USART0_US_CSR_USART_MODE_TXEMPTY Transmitter Empty (cleared by writing US_THR) **/
#define USART0_US_CSR_USART_MODE_TXEMPTY		(1 << 9)
/** USART0_US_CSR_USART_MODE_OVRE Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART0_US_CSR_USART_MODE_OVRE		(1 << 5)
/** USART0_US_CSR_USART_MODE_RXBRK Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART0_US_CSR_USART_MODE_RXBRK		(1 << 2)
/** USART0_US_CSR_USART_MODE_TXRDY Transmitter Ready (cleared by writing US_THR) **/
#define USART0_US_CSR_USART_MODE_TXRDY		(1 << 1)
/** USART0_US_CSR_USART_MODE_RXRDY Receiver Ready (cleared by reading US_RHR) **/
#define USART0_US_CSR_USART_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_us_csr_usart_lin_mode USCSRUSARTLINMODE Channel Status Register
@{*/

/** USART0_US_CSR_USART_LIN_MODE_DCDIC Data Carrier Detect Input Change Flag (cleared on read) **/
#define USART0_US_CSR_USART_LIN_MODE_DCDIC		(1 << 18)
/** USART0_US_CSR_USART_LIN_MODE_DSRIC Data Set Ready Input Change Flag (cleared on read) **/
#define USART0_US_CSR_USART_LIN_MODE_DSRIC		(1 << 17)
/** USART0_US_CSR_USART_LIN_MODE_RIIC Ring Indicator Input Change Flag (cleared on read) **/
#define USART0_US_CSR_USART_LIN_MODE_RIIC		(1 << 16)
/** USART0_US_CSR_USART_LIN_MODE_TXEMPTY Transmitter Empty (cleared by writing US_THR) **/
#define USART0_US_CSR_USART_LIN_MODE_TXEMPTY		(1 << 9)
/** USART0_US_CSR_USART_LIN_MODE_TIMEOUT Receiver Timeout (cleared by writing a one to bit US_CR.STTTO) **/
#define USART0_US_CSR_USART_LIN_MODE_TIMEOUT		(1 << 8)
/** USART0_US_CSR_USART_LIN_MODE_PARE Parity Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART0_US_CSR_USART_LIN_MODE_PARE		(1 << 7)
/** USART0_US_CSR_USART_LIN_MODE_FRAME Framing Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART0_US_CSR_USART_LIN_MODE_FRAME		(1 << 6)
/** USART0_US_CSR_USART_LIN_MODE_OVRE Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART0_US_CSR_USART_LIN_MODE_OVRE		(1 << 5)
/** USART0_US_CSR_USART_LIN_MODE_TXRDY Transmitter Ready (cleared by writing US_THR) **/
#define USART0_US_CSR_USART_LIN_MODE_TXRDY		(1 << 1)
/** USART0_US_CSR_USART_LIN_MODE_RXRDY Receiver Ready (cleared by reading US_RHR) **/
#define USART0_US_CSR_USART_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_us_csr_spi_mode USCSRSPIMODE Channel Status Register
@{*/

