grevaillot/svd_tools/headers/ATSAMV71N21B/usart0.h
/** USART0_US_RHR_RXSYNH Received Sync **/
#define USART0_US_RHR_RXSYNH		(1 << 15)

#define USART0_US_RHR_RXCHR_SHIFT		0
#define USART0_US_RHR_RXCHR_MASK		0x1ff
/** @defgroup usart0_us_rhr_rxchr RXCHR Received Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_thr USTHR Transmit Holding Register
@{*/

/** USART0_US_THR_TXSYNH Sync Field to be Transmitted **/
#define USART0_US_THR_TXSYNH		(1 << 15)

#define USART0_US_THR_TXCHR_SHIFT		0
#define USART0_US_THR_TXCHR_MASK		0x1ff
/** @defgroup usart0_us_thr_txchr TXCHR Character to be Transmitted
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_brgr USBRGR Baud Rate Generator Register
@{*/


#define USART0_US_BRGR_FP_SHIFT		16
#define USART0_US_BRGR_FP_MASK		0x07
/** @defgroup usart0_us_brgr_fp FP Fractional Part
@{*/
/**@}*/


#define USART0_US_BRGR_CD_SHIFT		0
#define USART0_US_BRGR_CD_MASK		0xffff
/** @defgroup usart0_us_brgr_cd CD Clock Divider
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_rtor USRTOR Receiver Timeout Register
@{*/


#define USART0_US_RTOR_TO_SHIFT		0
#define USART0_US_RTOR_TO_MASK		0x1ffff
/** @defgroup usart0_us_rtor_to TO Timeout Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_ttgr_usart_mode USTTGRUSARTMODE Transmitter Timeguard Register
@{*/


#define USART0_US_TTGR_USART_MODE_TG_SHIFT		0
#define USART0_US_TTGR_USART_MODE_TG_MASK		0xff
/** @defgroup usart0_us_ttgr_usart_mode_tg TG Timeguard Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_ttgr_lon_mode USTTGRLONMODE Transmitter Timeguard Register
@{*/


#define USART0_US_TTGR_LON_MODE_PCYCLE_SHIFT		0
#define USART0_US_TTGR_LON_MODE_PCYCLE_MASK		0xffffff
/** @defgroup usart0_us_ttgr_lon_mode_pcycle PCYCLE LON PCYCLE Length
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_fidi_usart_mode USFIDIUSARTMODE FI DI Ratio Register
@{*/


#define USART0_US_FIDI_USART_MODE_FI_DI_RATIO_SHIFT		0
#define USART0_US_FIDI_USART_MODE_FI_DI_RATIO_MASK		0xffff
/** @defgroup usart0_us_fidi_usart_mode_fi_di_ratio FIDIRATIO FI Over DI Ratio Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_fidi_lon_mode USFIDILONMODE FI DI Ratio Register
@{*/


#define USART0_US_FIDI_LON_MODE_BETA2_SHIFT		0
#define USART0_US_FIDI_LON_MODE_BETA2_MASK		0xffffff
/** @defgroup usart0_us_fidi_lon_mode_beta2 BETA2 LON BETA2 Length
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_ner USNER Number of Errors Register
@{*/


#define USART0_US_NER_NB_ERRORS_SHIFT		0
#define USART0_US_NER_NB_ERRORS_MASK		0xff
/** @defgroup usart0_us_ner_nb_errors NBERRORS Number of Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_if USIF IrDA Filter Register
@{*/


#define USART0_US_IF_IRDA_FILTER_SHIFT		0
#define USART0_US_IF_IRDA_FILTER_MASK		0xff
/** @defgroup usart0_us_if_irda_filter IRDAFILTER IrDA Filter
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_man USMAN Manchester Configuration Register
@{*/

/** USART0_US_MAN_RXIDLEV Receiver Idle Value **/
#define USART0_US_MAN_RXIDLEV		(1 << 31)
/** USART0_US_MAN_DRIFT Drift Compensation **/
#define USART0_US_MAN_DRIFT		(1 << 30)
/** USART0_US_MAN_ONE Must Be Set to 1 **/
#define USART0_US_MAN_ONE		(1 << 29)
/** USART0_US_MAN_RX_MPOL Receiver Manchester Polarity **/
#define USART0_US_MAN_RX_MPOL		(1 << 28)

#define USART0_US_MAN_RX_PP_SHIFT		24
#define USART0_US_MAN_RX_PP_MASK		0x03
/** @defgroup usart0_us_man_rx_pp RXPP Receiver Preamble Pattern detected
@{*/
/**@}*/


#define USART0_US_MAN_RX_PL_SHIFT		16
#define USART0_US_MAN_RX_PL_MASK		0x0f
/** @defgroup usart0_us_man_rx_pl RXPL Receiver Preamble Length
@{*/
/**@}*/

/** USART0_US_MAN_TX_MPOL Transmitter Manchester Polarity **/
#define USART0_US_MAN_TX_MPOL		(1 << 12)

#define USART0_US_MAN_TX_PP_SHIFT		8
#define USART0_US_MAN_TX_PP_MASK		0x03
/** @defgroup usart0_us_man_tx_pp TXPP Transmitter Preamble Pattern
@{*/
/**@}*/


#define USART0_US_MAN_TX_PL_SHIFT		0
#define USART0_US_MAN_TX_PL_MASK		0x0f
/** @defgroup usart0_us_man_tx_pl TXPL Transmitter Preamble Length
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_linmr USLINMR LIN Mode Register
@{*/

/** USART0_US_LINMR_SYNCDIS Synchronization Disable **/
#define USART0_US_LINMR_SYNCDIS		(1 << 17)
/** USART0_US_LINMR_PDCM DMAC Mode **/
#define USART0_US_LINMR_PDCM		(1 << 16)

#define USART0_US_LINMR_DLC_SHIFT		8
#define USART0_US_LINMR_DLC_MASK		0xff
/** @defgroup usart0_us_linmr_dlc DLC Data Length Control
@{*/
/**@}*/

/** USART0_US_LINMR_WKUPTYP Wakeup Signal Type **/
#define USART0_US_LINMR_WKUPTYP		(1 << 7)
/** USART0_US_LINMR_FSDIS Frame Slot Mode Disable **/
#define USART0_US_LINMR_FSDIS		(1 << 6)
/** USART0_US_LINMR_DLM Data Length Mode **/
#define USART0_US_LINMR_DLM		(1 << 5)
/** USART0_US_LINMR_CHKTYP Checksum Type **/
#define USART0_US_LINMR_CHKTYP		(1 << 4)
/** USART0_US_LINMR_CHKDIS Checksum Disable **/
#define USART0_US_LINMR_CHKDIS		(1 << 3)
/** USART0_US_LINMR_PARDIS Parity Disable **/
#define USART0_US_LINMR_PARDIS		(1 << 2)

#define USART0_US_LINMR_NACT_SHIFT		0
#define USART0_US_LINMR_NACT_MASK		0x03
/** @defgroup usart0_us_linmr_nact NACT LIN Node Action
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_linir USLINIR LIN Identifier Register
@{*/


#define USART0_US_LINIR_IDCHR_SHIFT		0
#define USART0_US_LINIR_IDCHR_MASK		0xff
/** @defgroup usart0_us_linir_idchr IDCHR Identifier Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_linbrr USLINBRR LIN Baud Rate Register
@{*/


#define USART0_US_LINBRR_LINFP_SHIFT		16
#define USART0_US_LINBRR_LINFP_MASK		0x07
/** @defgroup usart0_us_linbrr_linfp LINFP Fractional Part after Synchronization
@{*/
/**@}*/


#define USART0_US_LINBRR_LINCD_SHIFT		0
#define USART0_US_LINBRR_LINCD_MASK		0xffff
/** @defgroup usart0_us_linbrr_lincd LINCD Clock Divider after Synchronization
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_us_lonmr USLONMR LON Mode Register
@{*/


#define USART0_US_LONMR_EOFS_SHIFT		16
#define USART0_US_LONMR_EOFS_MASK		0xff
/** @defgroup usart0_us_lonmr_eofs EOFS End of Frame Condition Size
@{*/
/**@}*/

/** USART0_US_LONMR_LCDS LON Collision Detection Source **/
#define USART0_US_LONMR_LCDS		(1 << 5)
/** USART0_US_LONMR_DMAM LON DMA Mode **/
#define USART0_US_LONMR_DMAM		(1 << 4)
/** USART0_US_LONMR_CDTAIL LON Collision Detection on Frame Tail **/
#define USART0_US_LONMR_CDTAIL		(1 << 3)
/** USART0_US_LONMR_TCOL Terminate Frame upon Collision Notification **/
#define USART0_US_LONMR_TCOL		(1 << 2)
/** USART0_US_LONMR_COLDET LON Collision Detection Feature **/
#define USART0_US_LONMR_COLDET		(1 << 1)
/** USART0_US_LONMR_COMMT LON comm_type Parameter Value **/
#define USART0_US_LONMR_COMMT		(1 << 0)

/**@}*/

/** @defgroup usart0_us_lonpr USLONPR LON Preamble Register
@{*/


#define USART0_US_LONPR_LONPL_SHIFT		0
#define USART0_US_LONPR_LONPL_MASK		0x3fff
/** @defgroup usart0_us_lonpr_lonpl LONPL LON Preamble Length
@{*/
/**@}*/


/**@}*/

